       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'PI'.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 PI         PIC 9.999999.
           01 NUMSTEPS   PIC 9(9) VALUE 2000000.
           01 STEPNUMBER PIC 9(9) VALUE 0.
           01 TOTALSUM   COMPUTATIONAL-2.
           01 STEPSIZE   COMPUTATIONAL-2.
           01 X          COMPUTATIONAL-2.
           01 THISSLICE  COMPUTATIONAL-2.
           01 TEMP       COMPUTATIONAL-2.
       PROCEDURE DIVISION.
           DISPLAY 'CALCULATING PI WITH: '
           DISPLAY '  ' NUMSTEPS ' SLICES'
           COMPUTE TEMP = NUMSTEPS
           COMPUTE STEPSIZE = 1/TEMP
           PERFORM ADVANCE UNTIL STEPNUMBER EQUAL TO NUMSTEPS
           COMPUTE PI = TOTALSUM * STEPSIZE
           DISPLAY 'OBTAINED VALUE OF PI: ' PI.
           STOP RUN.
       ADVANCE.
           COMPUTE X = (STEPNUMBER + 0.5) * STEPSIZE.
           COMPUTE THISSLICE = (4 / (1 + (X * X))).
           ADD THISSLICE TO TOTALSUM.
           ADD 1 TO STEPNUMBER.
